starter-kit-gnus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Starter Kit Gnus</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-16 15:51:42 PDT"/>
<meta name="author" content="Eric Schulte"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="emacs.css" type="text/css"/>

</head>
<body>
<div id="content">

<h1 class="title">Starter Kit Gnus</h1>
<p>This is part of the <a href="starter-kit.gnus">Emacs Starter Kit</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Starter Kit Gnus </h2>
<div class="outline-text-2" id="text-1">

<p>Configuration for the notoriously difficult to configure <a href="http://www.gnus.org/">Gnus</a> email
client
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">IMAP </h2>
<div class="outline-text-2" id="text-2">

<p>Based on the instructions at <a href="http://www.emacswiki.org/emacs/GnusGmail#toc2">emacswiki:GnusGmail</a>.
</p>
<p>
to use this file:
</p><ol>
<li><i>personal information</i> in this file (specifically in the code
   blocks which will be tangled in the next step) globally replace
   "your-name" with your gmail username, and "your-password" with your
   gmail password.

</li>
<li><i>tangle this file</i> Run the <code>org-babel-tangle</code> command to extract
   the code embedded in this file into a <code>starter-git-gnus-imap.el</code>
   file which can be added to your configuration, and a <code>~/.authinfo</code>
   file which will be used by gnus.

</li>
<li><i>load this configuration</i> If you have a recent version of Org-mode
   (i.e. after 7.0) or are using the <a href="http://eschulte.github.com/emacs-starter-kit/">literate Emacs Starter Kit</a>, then
   this file can be loaded directly using the <code>org-babel-load-file</code>
   function, or by placing it in your load path (if you're using the
   starter kit).

<p>     
   Alternately ensure that the <code>gnus-gmail.el</code> file generated by the
   previous step is loaded by your configuration.
</p>
</li>
<li><i>fire up gnus</i> This can be done with the command <code>M-x gnus</code>

</li>
<li><i>view your mail</i> After gnus boots up you will see the "Group
   Buffer" (see <a href="http://www.gnu.org/software/emacs/manual/html_node/gnus/index.html#toc_Group-Buffer">Group-Buffer</a>).  Each line is a mail "Group", hit
   <code>SPACE</code> or <code>ENTER</code> on a group to view it's contents.  You should
   see an "INBOX" group which contains the mail in your gmail account.
   If not, you can jump to the "INBOX" group by
<ul>
<li>pressing <code>j</code> for "jump"
</li>
<li>tab completing the name "INBOX"
</li>
<li>pressing <code>U</code> for "unkill" meaning this will now always be
       displayed in your Group buffer when you have new mail

</li>
</ul>

</li>
<li><i>customize</i> Gnus has unrivalled capacity for customization.  Once
   your comfortable with basic usage, take some time to browse through
   the very readable <a href="http://www.gnu.org/software/emacs/manual/html_node/gnus/index.html">Gnus Manual</a> to learn untold tricks (see also
   <a href="starter-kit-gnus.html#customization">Starter-kit-gnus:Customizations</a>).
</li>
</ol>



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1">saving mail locally </h3>
<div class="outline-text-3" id="text-2_1">

<p>Where your mail will be saved locally default value will be <code>~/gmail</code>.
</p>


<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">gnus</span>)
(setq nnml-directory <span class="org-string">"~/gmail"</span>)
(setq message-directory <span class="org-string">"~/gmail"</span>)

</pre>



<p>
All Gmail groups will be ignored by the default value of
<code>gnus-ignored-newsgroups</code>, so let's change that default value.
</p>


<pre class="src src-emacs-lisp">(setq gnus-ignored-newsgroups <span class="org-string">"^to\\.</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">^[0-9. ]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string"> </span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">$</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">^[\&#8221;]\&#8221;[#&#8217;()]"</span>)

</pre>



</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2">getting mail </h3>
<div class="outline-text-3" id="text-2_2">

<p>Set Gmail as the primary source for incoming mail (Gnus can aggregate
many email and/or newsgroup sources).
</p>


<pre class="src src-emacs-lisp">(setq gnus-select-method
      '(nnimap <span class="org-string">"gmail"</span>
               (nnimap-address <span class="org-string">"imap.gmail.com"</span>)
               (nnimap-server-port 993)
               (nnimap-stream ssl)))

</pre>



<p>
Place a line like the following in <code>~/.authinfo</code>
</p>


<pre class="src src-fundamental">machine imap.gmail.com login your-name@gmail.com password your-password port 993

</pre>



<p>
and make sure that no-one else can read it with
</p>


<pre class="src src-sh">chmod 600 ~/.authinfo

</pre>



</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3">sending mail </h3>
<div class="outline-text-3" id="text-2_3">

<p><i>Requirement</i>: gnus uses the <a href="http://en.wikipedia.org/wiki/STARTTLS">starttls</a> tool for encrypted sending of
email to the Gmail SMTP server.  This is easily installed on modern
Debian (including Ubuntu) systems with
</p>


<pre class="src src-sh">apt-get install starttls

</pre>



<p>
The following configures gnus to use the Gmail SMTP server for sending
email.
</p>


<pre class="src src-emacs-lisp">(setq message-send-mail-function 'smtpmail-send-it
      smtpmail-starttls-credentials '((<span class="org-string">"smtp.gmail.com"</span> 587 nil nil))
      smtpmail-auth-credentials '((<span class="org-string">"smtp.gmail.com"</span> 587 <span class="org-string">"your-name@gmail.com"</span> nil))
      smtpmail-default-smtp-server <span class="org-string">"smtp.gmail.com"</span>
      smtpmail-smtp-server <span class="org-string">"smtp.gmail.com"</span>
      smtpmail-smtp-service 587)

</pre>



<p>
If you don't want to be prompted for a password on every mail sent,
you can add the following line to your <code>~/.authinfo</code>.
</p>


<pre class="src src-fundamental">machine smtp.gmail.com login your-name@gmail.com your-password secret port 587

</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Pop </h2>
<div class="outline-text-2" id="text-3">

<p>This file can be used to jump start a working Gnus instillation.  The
following steps will result in a working vanilla Gnus POP
instillation.
</p><ol>
<li>install the <a href="#sec-3-2">required-packages</a>
</li>
<li>follow the <a href="#sec-3-3">gmail</a> specific instructions
</li>
<li>tangle this file with `org-babel-tangle' (with C-c M-b t) creating
   the <code>starter-kit-gnus-pop.el</code> file which can be loaded by Emacs
</li>
</ol>


<p>
(if you run into any problems &ndash; the <a href="http://www.gnus.org/manual.html">gnus manual</a> is very thorough)
</p>

</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1">Basic configuration </h3>
<div class="outline-text-3" id="text-3_1">

<p>First off, load up <code>gnus</code>
</p>


<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">gnus</span>)

</pre>



<p>
Tell gnus that your mainly going to be using it for email not as a
news reader &ndash; after all it's not longer the late 80s.
</p>


<pre class="src src-emacs-lisp">(setq gnus-select-method '(nnml <span class="org-string">""</span>))

</pre>



</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><a name="sec-3-2" id="sec-3-2"></a>Required packages </h3>
<div class="outline-text-3" id="text-3_2">

<p>A <a href="http://en.wikipedia.org/wiki/STARTTLS">starttls</a> client allows encrypted communication with remote pop3 and
IMAP email clients.
</p>
<p>
<a href="http://www.openssl.org/">openssl</a> implements the Secure Socket Layer (SSL) secure communication
protocol.
</p>
<p>
On Debian systems (including Ubuntu) instillation of <code>starttls</code> and
<code>openssl</code> client is as simple as
</p><pre class="example">
sudo apt-get install starttls openssl
</pre>


</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><a name="sec-3-3" id="sec-3-3"></a>Gmail Setup </h3>
<div class="outline-text-3" id="text-3_3">

<p>For more information on configuring Gnus with Gmail see <a href="http://www.emacswiki.org/emacs/GnusGmail">GnusGmail</a> on
the Emacs Wiki.
</p>
<p>
For a simple pop3 setup, simply replace <code>your-gmail-email-address</code> and
<code>your-gmail-password</code> with your gmail account information in the
following tables.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">email</td><td class="left">your-gmail-email-address</td></tr>
<tr><td class="left">password</td><td class="left">your-gmail-password</td></tr>
</tbody>
</table>





<pre class="src src-emacs-lisp">(<span class="org-keyword">let</span> ((email (second (first config)))
      (passwd (second (second config))))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">The following adds Gmail as a source of mail for Gnus</span>
  (add-to-list 'mail-sources
               `(pop <span class="org-builtin">:server</span> <span class="org-string">"pop.gmail.com"</span>
                     <span class="org-builtin">:port</span> 995
                     <span class="org-builtin">:user</span> ,email
                     <span class="org-builtin">:password</span> ,passwd
                     <span class="org-builtin">:stream</span> ssl))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">The following is used for sending email through gmail using SMTP.</span>
  (setq message-send-mail-function 'smtpmail-send-it
        smtpmail-starttls-credentials '((<span class="org-string">"smtp.gmail.com"</span> 25 nil nil))
        smtpmail-default-smtp-server <span class="org-string">"smtp.gmail.com"</span>
        smtpmail-smtp-server <span class="org-string">"smtp.gmail.com"</span>
        smtpmail-smtp-service 25
        user-mail-address email
        smtpmail-starttls-credentials '((<span class="org-string">"smtp.gmail.com"</span> 587 nil nil))
        smtpmail-auth-credentials `((<span class="org-string">"smtp.gmail.com"</span> 587 ,email ,passwd))
        smtpmail-default-smtp-server <span class="org-string">"smtp.gmail.com"</span>
        smtpmail-smtp-server <span class="org-string">"smtp.gmail.com"</span>
        smtpmail-smtp-service 587))

</pre>



</div>
</div>

</div>

<div id="outline-container-customization" class="outline-2">
<h2 id="customization"><a name="sec-4" id="sec-4"></a>Customizations </h2>
<div class="outline-text-2" id="text-customization">

<p>Once gnus is installed and working, here are some recommended Gnus
customizations.
</p>

</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1">BBDB </h3>
<div class="outline-text-3" id="text-4_1">

<p><a href="http://bbdb.sourceforge.net/">BBDB</a> &ndash; <span style="text-decoration:underline;">The Insidious Big Brother Database</span> is Emacs' contact manager
which is very useful for keeping all of your contacts organized for
use with gnus.
</p>



<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">bbdb</span>
(<span class="org-keyword">require</span> '<span class="org-constant">bbdb</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">bbdb-autoloads</span>)
(setq
 bbdb-file <span class="org-string">"~/.bbdb"</span>
 bbdb-offer-save 'auto
 bbdb-notice-auto-save-file t
 bbdb-expand-mail-aliases t
 bbdb-canonicalize-redundant-nets-p t
 bbdb-always-add-addresses t
 bbdb-complete-name-allow-cycling t
 )

</pre>



</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2">More attractive Summary View </h3>
<div class="outline-text-3" id="text-4_2">

<p>Thanks to Dan Davison.
</p>



<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">http://groups.google.com/group/gnu.emacs.gnus/browse_thread/thread/a673a74356e7141f</span>
(<span class="org-keyword">when</span> window-system
  (setq gnus-sum-thread-tree-indent <span class="org-string">"  "</span>)
  (setq gnus-sum-thread-tree-root <span class="org-string">""</span>) <span class="org-comment-delimiter">;; </span><span class="org-comment">"&#9679; ")</span>
  (setq gnus-sum-thread-tree-false-root <span class="org-string">""</span>) <span class="org-comment-delimiter">;; </span><span class="org-comment">"&#9711; ")</span>
  (setq gnus-sum-thread-tree-single-indent <span class="org-string">""</span>) <span class="org-comment-delimiter">;; </span><span class="org-comment">"&#9678; ")</span>
  (setq gnus-sum-thread-tree-vertical        <span class="org-string">"&#9474;"</span>)
  (setq gnus-sum-thread-tree-leaf-with-other <span class="org-string">"&#9500;&#9472;&#9658; "</span>)
  (setq gnus-sum-thread-tree-single-leaf     <span class="org-string">"&#9584;&#9472;&#9658; "</span>))
(setq gnus-summary-line-format
      (concat
       <span class="org-string">"%0{%U%R%z%}"</span>
       <span class="org-string">"%3{&#9474;%}"</span> <span class="org-string">"%1{%d%}"</span> <span class="org-string">"%3{&#9474;%}"</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">date</span>
       <span class="org-string">"  "</span>
       <span class="org-string">"%4{%-20,20f%}"</span>               <span class="org-comment-delimiter">;; </span><span class="org-comment">name</span>
       <span class="org-string">"  "</span>
       <span class="org-string">"%3{&#9474;%}"</span>
       <span class="org-string">" "</span>
       <span class="org-string">"%1{%B%}"</span>
       <span class="org-string">"%s\n"</span>))
(setq gnus-summary-display-arrow t)

</pre>


</div>
</div>
</div>

</div>
</body>
</html>
